add architecture diagram to README
